#### Terraform Apply 📖`
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_resource_group.rg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "rg" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = (known after apply)
    }

[1m  # random_pet.rg_name[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_pet" "rg_name" {
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m    = 2
      [32m+[0m [0m[1m[0mprefix[0m[0m    = "rg"
      [32m+[0m [0m[1m[0mseparator[0m[0m = "-"
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mresource_group_name[0m[0m = (known after apply)
[0m[1mrandom_pet.rg_name: Creating...[0m[0m
[0m[1mrandom_pet.rg_name: Creation complete after 0s [id=rg-teaching-trout][0m
[0m[1mazurerm_resource_group.rg: Creating...[0m[0m
[0m[1mazurerm_resource_group.rg: Creation complete after 0s [id=/subscriptions/3c0222f1-458b-4eaa-b785-3a5502d97ab0/resourceGroups/rg-teaching-trout][0m
[0m[1m[32m
Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mresource_group_name = "rg-teaching-trout"
`